# 10.1

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.342267  1.273810
1    a  two  0.443635 -0.308600
2    b  one  1.820946  0.857583
3    b  two -1.806337 -0.800996
4    a  one  0.736830 -1.298874

In [4]:
grouped=df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.279399
b    0.007305
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.197281
      two     0.443635
b     one     1.820946
      two    -1.806337
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     0.197281  0.443635
b     1.820946 -1.806337

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states,years]).mean()

California  2005    0.443635
            2006    1.820946
Ohio        2005   -1.074302
            2006    0.736830
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.279399 -0.111221
b     0.007305  0.028294

In [14]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.197281 -0.012532
     two   0.443635 -0.308600
b    one   1.820946  0.857583
     two  -1.806337 -0.800996

In [15]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.342267  1.273810
1    a  two  0.443635 -0.308600
4    a  one  0.736830 -1.298874
b
  key1 key2     data1     data2
2    b  one  1.820946  0.857583
3    b  two -1.806337 -0.800996

In [17]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.342267  1.273810
4    a  one  0.736830 -1.298874
('a', 'two')
  key1 key2     data1   data2
1    a  two  0.443635 -0.3086
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.820946  0.857583
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.806337 -0.800996

In [18]:
pieces = dict(list(df.groupby('key1')))

In [19]:
pieces['b']

  key1 key2     data1     data2
2    b  one  1.820946  0.857583
3    b  two -1.806337 -0.800996

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)

In [22]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.342267  1.273810
1  0.443635 -0.308600
2  1.820946  0.857583
3 -1.806337 -0.800996
4  0.736830 -1.298874
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [23]:
df.groupby('key1')['data1']

In [24]:
df.groupby('key1')[['data2']]

In [25]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.012532
     two  -0.308600
b    one   0.857583
     two  -0.800996

In [26]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [27]:
s_grouped

In [28]:
s_grouped.mean()

key1  key2
a     one    -0.012532
      two    -0.308600
b     one     0.857583
      two    -0.800996
Name: data2, dtype: float64

In [29]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a','b','c','d','e'],
                     index=['Joe', 'Steve','Wes','Jim','Travis'])

In [30]:
people.iloc[2:3, [1,2]] = np.nan

In [31]:
people

               a         b         c         d         e
Joe     0.724583  2.033962  0.203375  0.507593  0.155010
Steve  -0.954151 -0.759976  0.105022  0.874771 -0.095151
Wes     0.989789       NaN       NaN  0.628838 -1.885295
Jim    -0.940163 -0.585337 -0.095667 -0.366367  0.558561
Travis -0.232102  1.495493 -0.347142  0.873223  0.561148

In [32]:
mapping = {'a':'red','b':'red','c':'blue',
          'd':'blue','e':'red','f':'orange'}

In [33]:
by_columns=people.groupby(mapping, axis=1)

In [34]:
by_columns.sum()

            blue       red
Joe     0.710968  2.913555
Steve   0.979793 -1.809279
Wes     0.628838 -0.895505
Jim    -0.462034 -0.966939
Travis  0.526082  1.824540

In [35]:
map_series = pd.Series(mapping)

In [36]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [37]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [38]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.774209  1.448625  0.107708  0.770065 -1.171723
5 -0.954151 -0.759976  0.105022  0.874771 -0.095151
6 -0.232102  1.495493 -0.347142  0.873223  0.561148

In [39]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [40]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.724583  2.033962  0.203375  0.507593 -1.885295
  two -0.940163 -0.585337 -0.095667 -0.366367  0.558561
5 one -0.954151 -0.759976  0.105022  0.874771 -0.095151
6 two -0.232102  1.495493 -0.347142  0.873223  0.561148

In [41]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                    [1,3,5,1,3]],
                                   names=['cty','tenor'])

In [42]:
hier_df=pd.DataFrame(np.random.randn(4,5), columns=columns)

In [43]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      2.337969  0.478273  0.995393 -0.418700  0.796690
1      0.723797 -0.493799 -2.150663  0.493163  1.539860
2      0.272370  1.714498 -0.395074  0.257679  0.402921
3      1.105256 -1.072327 -1.698166  0.187002 -1.955759

In [44]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [45]:
df

  key1 key2     data1     data2
0    a  one -0.342267  1.273810
1    a  two  0.443635 -0.308600
2    b  one  1.820946  0.857583
3    b  two -1.806337 -0.800996
4    a  one  0.736830 -1.298874

In [46]:
grouped=df.groupby('key1')

In [47]:
grouped['data1'].quantile(0.9)

key1
a    0.678191
b    1.458218
Name: data1, dtype: float64

In [48]:
def peak_to_peak(arr):
    return arr.max() -arr.min()

In [49]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.079097  2.572684
b     3.627284  1.658578

In [50]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.279399  0.557981 -0.342267  0.050684  0.443635  0.590232
b      2.0  0.007305  2.564877 -1.806337 -0.899516  0.007305  0.914126

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.736830   3.0 -0.111221  1.297649 -1.298874 -0.803737 -0.308600
b     1.820946   2.0  0.028294  1.172792 -0.800996 -0.386351  0.028294


           75%       max
key1
a     0.482605  1.273810
b     0.442938  0.857583

In [51]:
tips = pd.read_csv('examples/tips.csv')

In [52]:
tips['tip_pct']=tips['tip']/tips['total_bill']

In [53]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [54]:
grouped = tips.groupby(['day','smoker'])

In [55]:
grouped_pct=grouped['tip_pct']

In [56]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [57]:
grouped_pct.agg(['mean','std'])

                 mean       std
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [58]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [59]:
functions = ['count','mean','max']

In [60]:
result=grouped['tip_pct','total_bill'].agg(functions)

C:\ProgramData\Anaconda3\envs\songtest01\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [61]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [62]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [63]:
ftuples = [('Durchschnitt', 'mean'),('Abweichung', np.var)]

In [64]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

C:\ProgramData\Anaconda3\envs\songtest01\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [65]:
grouped.agg({'tip':np.max,'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [66]:
grouped.agg({'tip_pct':['min','max','mean','std'],
            'size':'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [67]:
tips.groupby(['day','smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## 10.3

In [68]:
def top(df, n=5, columns='tip_pct'):
    return df.sort_values(by=columns)[-n:]

In [69]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [70]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [71]:
tips.groupby(['smoker','day']).apply(top, n=1,columns='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [72]:
result=tips.groupby('smoker')['tip_pct'].describe()

In [73]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [74]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [75]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [76]:
frame=pd.DataFrame({'data1':np.random.randn(1000),
                   'data2':np.random.randn(1000)})

In [77]:
quartiles = pd.cut(frame.data1,4)

In [78]:
quartiles[:10]

0       (0.19, 1.677]
1      (-1.298, 0.19]
2       (0.19, 1.677]
3       (0.19, 1.677]
4    (-2.792, -1.298]
5       (0.19, 1.677]
6       (0.19, 1.677]
7      (-1.298, 0.19]
8      (-1.298, 0.19]
9      (-1.298, 0.19]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.792, -1.298] < (-1.298, 0.19] < (0.19, 1.677] < (1.677, 3.165]]

In [79]:
def get_stats(group):
    return {'min':group.min(), 'max':group.max(),
           'count':group.count(), 'mean':group.mean()}

In [80]:
grouped = frame.data2.groupby(quartiles)

In [81]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-2.792, -1.298] -2.484008  2.926147   97.0  0.051410
(-1.298, 0.19]   -2.695633  2.994565  453.0 -0.018355
(0.19, 1.677]    -3.367354  3.360844  397.0 -0.059933
(1.677, 3.165]   -2.340625  3.160813   53.0  0.088766

In [82]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [83]:
grouped = frame.data2.groupby(grouping)

In [84]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.484008  2.926147  100.0  0.044384
1     -2.009576  2.813670  100.0  0.054076
2     -2.626087  2.994565  100.0  0.002559
3     -1.914606  1.956124  100.0 -0.018568
4     -2.695633  2.616824  100.0 -0.091671
5     -2.248432  2.230291  100.0 -0.051151
6     -2.499462  2.736622  100.0 -0.071716
7     -3.367354  2.745393  100.0 -0.158486
8     -2.552030  3.360844  100.0  0.030044
9     -2.340625  3.171523  100.0  0.036363

In [85]:
s=pd.Series(np.random.randn(6))

In [86]:
s[::2]=np.nan

In [87]:
s

0         NaN
1   -1.858187
2         NaN
3    1.502399
4         NaN
5    0.399637
dtype: float64

In [88]:
s.fillna(s.mean())

0    0.014616
1   -1.858187
2    0.014616
3    1.502399
4    0.014616
5    0.399637
dtype: float64

In [89]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
         'Oregon', 'Nevada', 'California', 'Idaho']

In [90]:
group_key = ['East']*4+['West']*4

In [91]:
data=pd.Series(np.random.randn(8), index=states)

In [92]:
data

Ohio         -2.790377
New York      0.485371
Vermont      -0.068205
Florida       0.126138
Oregon       -0.422809
Nevada       -0.311976
California    1.019368
Idaho        -1.614949
dtype: float64

In [93]:
data[['Vermont', 'Nevada', 'Idaho']]=np.nan

In [94]:
data

Ohio         -2.790377
New York      0.485371
Vermont            NaN
Florida       0.126138
Oregon       -0.422809
Nevada             NaN
California    1.019368
Idaho              NaN
dtype: float64

In [95]:
data.groupby(group_key).mean()

East   -0.72629
West    0.29828
dtype: float64

In [96]:
fill_mean=lambda g:g.fillna(g.mean())

In [97]:
data.groupby(group_key).apply(fill_mean)

Ohio         -2.790377
New York      0.485371
Vermont      -0.726290
Florida       0.126138
Oregon       -0.422809
Nevada        0.298280
California    1.019368
Idaho         0.298280
dtype: float64

In [98]:
fill_values={'East':0.5,'West':-1}

In [99]:
fill_func = lambda g:g.fillna(fill_values[g.name])

In [100]:
data.groupby(group_key).apply(fill_func)

Ohio         -2.790377
New York      0.485371
Vermont       0.500000
Florida       0.126138
Oregon       -0.422809
Nevada       -1.000000
California    1.019368
Idaho        -1.000000
dtype: float64

In [101]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1,11)) + [10]*3) *4
base_names = ['A'] + list(range(2,11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num)+suit for num in base_names)
    
deck = pd.Series(card_val, index=cards)

In [102]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [103]:
def draw(deck, n=5):
    return deck.sample(n)

In [104]:
draw(deck)

9D      9
AC      1
KH     10
10H    10
9S      9
dtype: int64

In [105]:
get_suit = lambda card: card[-1]

In [106]:
deck.groupby(get_suit).apply(draw, n=2)

C  4C      4
   3C      3
D  5D      5
   KD     10
H  2H      2
   10H    10
S  10S    10
   QS     10
dtype: int64

In [107]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

AC      1
KC     10
10D    10
QD     10
JH     10
3H      3
QS     10
JS     10
dtype: int64

## 10.3.5

In [108]:
df=pd.DataFrame({'category':['a','a','a','a',
                            'b','b','b','b'],
                'data':np.random.randn(8),
                'weights':np.random.rand(8)})

In [109]:
df

  category      data   weights
0        a  0.625868  0.432256
1        a -0.660749  0.561437
2        a  0.285002  0.375361
3        a  0.771379  0.107662
4        b  1.893393  0.678722
5        b  0.428941  0.042193
6        b -0.541740  0.943536
7        b -2.429553  0.210457

In [110]:
grouped = df.groupby('category')

In [111]:
get_wavg=lambda g:np.average(g['data'], weights=g['weights']) # weights

In [112]:
grouped.apply(get_wavg)

category
a    0.060670
b    0.149724
dtype: float64

In [113]:
np.average([1,3], weights=[1,3])

2.5

In [114]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,
                      index_col=0)

In [115]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [116]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [117]:
spx_corr = lambda x : x.corrwith(x['SPX'])

In [118]:
rets = close_px.pct_change().dropna()

In [119]:
get_year = lambda x:x.year

In [120]:
by_year=rets.groupby(get_year)

In [121]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [122]:
by_year.apply(lambda g:g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

## 10.3.6

In [123]:
import statsmodels.api as sm

In [124]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y,X).fit()
    return result.params

In [126]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [127]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [128]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [129]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [130]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [131]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                columns='day', aggfunc='mean', fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

## 10.4.1

In [139]:
data=pd.DataFrame({'Sample':range(1,11), 'Nationality':['USA','Japan','USA','Japan','Japan','Japan','USA','USA','Japan','USA'],
                  'Handedness':['Right-handed','Left-handed','Right-handed','Right-handed','Left-handed','Right-handed',
                               'Right-handed','Left-handed','Right-handed','Right-handed']})

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [140]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [142]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244